Oxmose/ESP32Weather/src/HealthMonitor/HealthMonitor.cpp
/*******************************************************************************
 * @file HealthMonitor.cpp
 *
 * @see HealthMonitor.h
 *
 * @author Alexy Torres Aurora Dugo
 *
 * @date 14/12/2025
 *
 * @version 1.0
 *
 * @brief Firmware Health Monitor functionalities.
 *
 * @details Firmware Health Monitor functionalities. Provides watchdogs, error
 * handling and monitoring.
 *
 * @copyright Alexy Torres Aurora Dugo
 ******************************************************************************/

/*******************************************************************************
 * INCLUDES
 ******************************************************************************/

/* Included headers */
#include <BSP.h>             /* Hardware services */
#include <string>            /* Standard string */
#include <cstdint>           /* Standard int types */
#include <Logger.h>          /* Logger services */
#include <Arduino.h>         /* Arduino library */
#include <Settings.h>        /* Firmware settings */
#include <APIHandler.h>      /* API Handler errors */
#include <esp32-hal-timer.h> /* ESP32 Timers */
#include <HMConfiguration.h> /* HM Configuration */
/* Header file */
#include <HealthMonitor.h>

/*******************************************************************************
 * CONSTANTS
 ******************************************************************************/

/**
 * @brief Defines the real-time task period tolerance in nanoseconds.
 */
#define HW_RT_TASK_PERIOD_TOLERANCE_NS 2000000ULL

/**
 * @brief Defines the real-time task period deadline in nanoseconds.
 */
#define HW_RT_TASK_DEADLINE_MISS_DELAY \
    (HW_RT_TASK_PERIOD_NS + HW_RT_TASK_PERIOD_TOLERANCE_NS)

/** @brief Real-Time Task timer prescaler. */
#define HW_RT_TASK_TIMER_PRESCALER 80ULL

/** @brief Real-Time Task timer input clock frequency. */
#define HW_RT_TASK_TIMER_FREQ 80000000ULL

/** @brief Decimator of the Real-Time Task timer interrupt. */
#define HW_RT_TASK_TIMER_DEC_INT                                \
    (                                                           \
        (HW_RT_TASK_TIMER_FREQ / HW_RT_TASK_TIMER_PRESCALER) /  \
        (1000000000ULL / HW_RT_TASK_PERIOD_NS)                  \
    )

/** @brief Hardware Real-Time Task name. */
#define HW_RT_TASK_NAME "HW-RT_TASK"
/** @brief Hardware Real-Time Task stack size in bytes. */
#define HW_RT_TASK_STACK 4096
/** @brief Hardware Real-Time Task priority. */
#define HW_RT_TASK_PRIO (configMAX_PRIORITIES - 1)
/** @brief Hardware Real-Time Task mapped core ID. */
#define HW_RT_TASK_CORE 0
/** @brief Defines the watchdogs lock timeout in nanoseconds. */
#define WD_LOCK_TIMEOUT_NS 20000000ULL
/** @brief Defines the watchdogs lock timeout in ticks. */
#define WD_LOCK_TIMEOUT_TICKS (pdMS_TO_TICKS(WD_LOCK_TIMEOUT_NS / 1000000ULL))

/** @brief Actions Task name. */
#define HM_ACTIONS_TASK_NAME "HM_ACTIONS_TASK"
/** @brief Actions Task stack size in bytes. */
#define HM_ACTIONS_TASK_STACK 4096
/** @brief Actions Task priority. */
#define HM_ACTIONS_TASK_PRIO (configMAX_PRIORITIES - 2)
/** @brief Actions Task mapped core ID. */
#define HM_ACTIONS_TASK_CORE 0
/** @brief Defines the size of the actions queue. */
#define HM_ACTIONS_TASK_QUEUE_LENGTH 10

/*******************************************************************************
 * STRUCTURES AND TYPES
 ******************************************************************************/
/**
 * @brief Defines the HM configuration entry, associating a HM event to a
 * specific handler.
 */
typedef void(*T_EventHandler)(void*);

/*******************************************************************************
 * MACROS
 ******************************************************************************/
/* None */

/*******************************************************************************
 * STATIC FUNCTIONS DECLARATIONS
 ******************************************************************************/
/**
 * @brief Real-time task timer handler.
 *
 * @details Real-time task timer handler. This IRQ handler will release the real
 * time task for execution.
 */
static void IRAM_ATTR RealTimeTaskTimerHandler(void);

/**
 * @brief HM Event hander for HM_EVENT_WEB_SERVER_INIT_ERROR event.
 *
 * @details HM Event hander for HM_EVENT_WEB_SERVER_INIT_ERROR event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMWebServerInitErrorHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_API_SERVER_INIT_ERROR event.
 *
 * @details HM Event hander for HM_EVENT_API_SERVER_INIT_ERROR event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMAPIServerInitErrorHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_HW_MAC_NOT_AVAIL event.
 *
 * @details HM Event hander for HM_EVENT_HW_MAC_NOT_AVAIL event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMHWMACNotAvailHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_HM_LOCK event.
 *
 * @details HM Event hander for HM_EVENT_HM_LOCK event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMHWLockHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_WD_TIMEOUT event.
 *
 * @details HM Event hander for HM_EVENT_WD_TIMEOUT event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMWdTimeoutHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_RT_TASK_CREATE event.
 *
 * @details HM Event hander for HM_EVENT_RT_TASK_CREATE event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMRTTaskCreateHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_RT_TASK_WAIT event.
 *
 * @details HM Event hander for HM_EVENT_RT_TASK_WAIT event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMRTTaskWait(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_RT_TASK_DEADLINE_MISS event.
 *
 * @details HM Event hander for HM_EVENT_RT_TASK_DEADLINE_MISS event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMRTTaskDeadlineMissHandler(void* pParam);


/**
 * @brief HM Event hander for HM_EVENT_SETTINGS_CREATE event.
 *
 * @details HM Event hander for HM_EVENT_SETTINGS_CREATE event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMSettingsCreateHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_SETTINGS_LOCK event.
 *
 * @details HM Event hander for HM_EVENT_SETTINGS_LOCK event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMSettingsLockHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_SETTINGS_LOAD event.
 *
 * @details HM Event hander for HM_EVENT_SETTINGS_LOAD event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMSettingsAccessLoadHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_SETTINGS_STORE event.
 *
 * @details HM Event hander for HM_EVENT_SETTINGS_STORE event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMSettingsAccessStoreHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_SETTINGS_DEFAULT event.
 *
 * @details HM Event hander for HM_EVENT_SETTINGS_DEFAULT event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMSettingsAccessDefaultHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_WIFI_CREATE event.
 *
 * @details HM Event hander for HM_EVENT_WIFI_CREATE event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMWifiCreateHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_WEB_START event.
 *
 * @details HM Event hander for HM_EVENT_WEB_START event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMWebStartHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_HM_ADD_ACTION event.
 *
 * @details HM Event hander for HM_EVENT_HM_ADD_ACTION event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMAddActionHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_HM_ACTION_RECV_FAILED event.
 *
 * @details HM Event hander for HM_EVENT_HM_ACTION_RECV_FAILED event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMActionQCreateFailedHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_ACTION_TASK_CREATE event.
 *
 * @details HM Event hander for HM_EVENT_ACTION_TASK_CREATE event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMActionTaskCreateHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_WEB_SERVER_NOT_FOUND event.
 *
 * @details HM Event hander for HM_EVENT_WEB_SERVER_NOT_FOUND event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMWebServerNotFoundHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_API_SERVER_NOT_FOUND event.
 *
 * @details HM Event hander for HM_EVENT_API_SERVER_NOT_FOUND event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMAPIServerNotFoundHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_HM_REMOVE_ACTION event.
 *
 * @details HM Event hander for HM_EVENT_HM_REMOVE_ACTION event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMRemoveActionHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_WIFI_STOP event.
 *
 * @details HM Event hander for HM_EVENT_WIFI_STOP event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMWiFiStopHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_SETTINGS_COMMIT event.
 *
 * @details HM Event hander for HM_EVENT_SETTINGS_COMMIT event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMSettingsAccessCommitHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_MAIN_LOOP_DEADLINE_MISS event.
 *
 * @details HM Event hander for HM_EVENT_MAIN_LOOP_DEADLINE_MISS event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMMainLoopDeadlineMissHandler(void* pParam);

/**
 * @brief HM Event hander for HM_EVENT_IO_BUTTON_LOCK event.
 *
 * @details HM Event hander for HM_EVENT_IO_BUTTON_LOCK event.
 *
 * @param[in] pParam The parameter used when notifying the HM of the event.
 */
static void HMIOButtonLockHandler(void* pParam);

