Oxmose/ESP32Weather/src/HealthMonitor/HealthMonitor.cpp
static void HMSettingsAccessLoadHandler(void* pParam) {
    S_HMParamSettingAccess* pAccessParam;
    E_Return                result;
    Settings*               pSettings;

    pAccessParam = (S_HMParamSettingAccess*)pParam;

    LOG_ERROR(
        "Failed to load setting %s. Applying default value.\n",
        pAccessParam->kpSettingName
    );

    /* Propagate the default setting */
    pSettings = SystemState::GetInstance()->GetSettings();

    result = pSettings->GetDefault(
        pAccessParam->kpSettingName,
        (uint8_t*)pAccessParam->pSettingBuffer,
        pAccessParam->settingBufferSize
    );
    if (E_Return::NO_ERROR != result) {
        HMSettingsAccessDefaultHandler(pParam);
    }

    /* Apply the default setting */
    result = pSettings->SetSettings(
        pAccessParam->kpSettingName,
        (uint8_t*)pAccessParam->pSettingBuffer,
        pAccessParam->settingBufferSize
    );
    if (E_Return::NO_ERROR != result) {
        LOG_ERROR(
            "Failed to set default setting %s.",
            pAccessParam->kpSettingName
        );
        HWManager::Reboot();
    }

    /* Commit */
    result = pSettings->Commit();
    if (E_Return::NO_ERROR != result) {
        LOG_ERROR(
            "Failed to commit default setting %s.",
            pAccessParam->kpSettingName
        );
        HWManager::Reboot();
    }
}

static void HMSettingsAccessStoreHandler(void* pParam) {
    S_HMParamSettingAccess* pAccessParam;

    pAccessParam = (S_HMParamSettingAccess*)pParam;

    LOG_ERROR(
        "Failed to set value for setting %s.\n",
        pAccessParam->kpSettingName
    );

    HWManager::Reboot();
}

static void HMSettingsAccessCommitHandler(void* pParam) {
    LOG_ERROR("Failed to commit settings. Error %d\n", (uint32_t)pParam);

    HWManager::Reboot();
}

static void HMSettingsAccessDefaultHandler(void* pParam) {
    S_HMParamSettingAccess* pAccessParam;

    pAccessParam = (S_HMParamSettingAccess*)pParam;

    LOG_ERROR(
        "Failed to get default value for setting %s.\n",
        pAccessParam->kpSettingName
    );
    HWManager::Reboot();
}

static void HMWifiCreateHandler(void* pParam) {
    if (0 == (uint32_t)pParam) {
        LOG_ERROR("Failed to instanciate the WiFi module.\n");
    }
    else {
        LOG_ERROR(
            "Failed to create the Web Servers, error: %d\n",
            (uint32_t)pParam
        );
    }
    HWManager::Reboot();
}

static void HMWebStartHandler(void* pParam) {
    LOG_ERROR("Failed to start the Web Servers, error: %d\n", (uint32_t)pParam);
    HWManager::Reboot();
}

static void HMAddActionHandler(void* pParam) {
    LOG_ERROR("Failed to add HM action, error: %d\n", (uint32_t)pParam);
    HWManager::Reboot();
}

static void HMActionQCreateFailedHandler(void* pParam) {
    LOG_ERROR("Failed create HM action queue, error: %d\n", (uint32_t)pParam);
    HWManager::Reboot();
}

static void HMActionTaskCreateHandler(void* pParam) {
    if (0 == (uint32_t)pParam) {
        LOG_ERROR("Failed to create the HM action queue.\n");
    }
    else {
        LOG_ERROR(
            "Failed to create the HM action task, error: %d\n",
            (uint32_t)pParam
        );
    }
    HWManager::Reboot();
}

static void HMWebServerNotFoundHandler(void* pParam) {
    S_HMParamWebServerError* pWebParam;

    pWebParam = (S_HMParamWebServerError*)pParam;

    /* Update the page content */
    *(pWebParam->pPage) = std::string("<h1>HM Error: ") +
        pWebParam->pPageURL +
        std::string(" not found</h1>");
}

static void HMAPIServerNotFoundHandler(void* pParam) {
    S_HMParamAPIServerError* pAPIParam;

    pAPIParam = (S_HMParamAPIServerError*)pParam;

    /* Update the page content */
    *(pAPIParam->pResponse) = std::string("{\"result\": ") +
        std::to_string(E_APIResult::API_RES_HM_ERROR) +
        std::string(", \"msg\": \"Unknown API ") +
        pAPIParam->pAPIURL +
        std::string(".\"}");
}

static void HMRemoveActionHandler(void* pParam) {
    LOG_ERROR("Failed to remove HM action, error: %d\n",(uint32_t)pParam);
    HWManager::Reboot();
}

static void HMWiFiStopHandler(void* pParam) {
    (void)pParam;
    LOG_ERROR("Failed to stop the WiFi module.\n");
    HWManager::Reboot();
}

static void HMMainLoopDeadlineMissHandler(void* pParam) {
    (void)pParam;
    LOG_ERROR("Main Loop has missed its deadline.\n");
    HWManager::Reboot();
}

static void HMIOButtonLockHandler(void* pParam) {
    LOG_ERROR("IO Button lock error:\n");
    if ((bool)pParam) {
        LOG_ERROR("\tFailed to lock.\n");
    }
    else {
        LOG_ERROR("\tFailed to unlock.\n");
    }
    HWManager::Reboot();
}
/*******************************************************************************
 * CLASS METHODS
 ******************************************************************************/

HealthMonitor::HealthMonitor(void) noexcept {
    this->_lastWDId = 0;
    this->_lastReporterId = 0;
    this->_systemState = E_SystemState::STARTING;

    this->_wdLock = xSemaphoreCreateMutex();
    if (nullptr == this->_wdLock) {
        LOG_ERROR("Failed to initialize Health Monitor Watchdogs lock.\n");
        HWManager::Reboot();
    }
    this->_reportersLock = xSemaphoreCreateMutex();
    if (nullptr == this->_reportersLock) {
        LOG_ERROR("Failed to initialize Health Monitor Reporters lock.\n");
        HWManager::Reboot();
    }

    /* Initialize the HM tasks */
    RealTimeTaskInit();
    ActionsTaskInit();
}

E_Return HealthMonitor::AddWatchdog(Timeout* pTimeout, uint32_t& rId) noexcept {
    E_Return error;

    /* Check settings */
    if (0 != pTimeout->GetNextWatchdogEvent()) {
        if (pdPASS == xSemaphoreTake(this->_wdLock, WD_LOCK_TIMEOUT_TICKS)) {
            if (this->_lastWDId < UINT32_MAX) {
                try {
                    this->_watchdogs.emplace(
                        std::make_pair(this->_lastWDId, pTimeout)
                    );
                    rId = this->_lastWDId++;
                    error = E_Return::NO_ERROR;
                }
                catch (std::exception& rExc) {
                    error = E_Return::ERR_UNKNOWN;
                }
            }
            else {
                error = E_Return::ERR_MEMORY;
            }

            if (pdPASS != xSemaphoreGive(this->_wdLock)) {
                HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_LOCK, 1);
            }
        }
        else {
            LOG_ERROR("Failed to acquire watchdogs lock.\n");
            error = E_Return::ERR_HM_TIMEOUT;
        }
    }
    else {
        error = E_Return::ERR_INVALID_PARAM;
    }

    return error;
}

