Oxmose/ESP32Weather/src/HealthMonitor/HealthMonitor.cpp
E_Return HealthMonitor::RemoveWatchdog(const uint32_t kId) noexcept {
    E_Return                                         error;
    std::unordered_map<uint32_t, Timeout*>::iterator it;

    if (pdPASS == xSemaphoreTake(this->_wdLock, WD_LOCK_TIMEOUT_TICKS)) {
        it = this->_watchdogs.find(kId);
        if (this->_watchdogs.end() != it) {
            try {
                this->_watchdogs.erase(it);
                error = E_Return::NO_ERROR;
            }
            catch (std::exception& rExc) {
                error = E_Return::ERR_UNKNOWN;
            }
        }
        else {
            error = E_Return::ERR_NO_SUCH_ID;
        }

        if (pdPASS != xSemaphoreGive(this->_wdLock)) {
            HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_LOCK, 1);
        }
    }
    else {
        LOG_ERROR("Failed to acquire watchdogs lock.\n");
        error = E_Return::ERR_HM_TIMEOUT;
    }

    return error;
}

void HealthMonitor::SetSystemState(const E_SystemState kState) noexcept {
    this->_systemState = kState;
}


E_Return HealthMonitor::AddReporter(HMReporter* pReporter,
                                    uint32_t&   rId) noexcept {
    E_Return error;

    /* Check settings */
    if (pdPASS == xSemaphoreTake(this->_reportersLock, WD_LOCK_TIMEOUT_TICKS)) {
        if (this->_lastReporterId < UINT32_MAX) {
            try {
                this->_reporters.emplace(
                    std::make_pair(this->_lastReporterId, pReporter)
                );
                rId = this->_lastReporterId++;
                error = E_Return::NO_ERROR;
            }
            catch (std::exception& rExc) {
                error = E_Return::ERR_UNKNOWN;
            }
        }
        else {
            error = E_Return::ERR_MEMORY;
        }

        if (pdPASS != xSemaphoreGive(this->_reportersLock)) {
            HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_LOCK, 1);
        }
    }
    else {
        LOG_ERROR("Failed to acquire reporters lock.\n");
        error = E_Return::ERR_HM_TIMEOUT;
    }

    return error;
}

E_Return HealthMonitor::RemoveReporter(const uint32_t kId) noexcept {
    E_Return                                            error;
    std::unordered_map<uint32_t, HMReporter*>::iterator it;

    if (pdPASS == xSemaphoreTake(this->_reportersLock, WD_LOCK_TIMEOUT_TICKS)) {
        it = this->_reporters.find(kId);
        if (this->_reporters.end() != it) {
            try {
                this->_reporters.erase(it);
                error = E_Return::NO_ERROR;
            }
            catch (std::exception& rExc) {
                error = E_Return::ERR_UNKNOWN;
            }
        }
        else {
            error = E_Return::ERR_NO_SUCH_ID;
        }

        if (pdPASS != xSemaphoreGive(this->_reportersLock)) {
            HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_LOCK, 1);
        }
    }
    else {
        LOG_ERROR("Failed to acquire reporters lock.\n");
        error = E_Return::ERR_HM_TIMEOUT;
    }

    return error;
}

E_Return HealthMonitor::AddHMAction(HMReporter* pReporter) noexcept {
    BaseType_t result;
    E_Return   retVal;

    /* Place the action in the actions queue */
    result = xQueueSend(this->_actionsQueue, (void*)&pReporter, 0);
    if (pdPASS != result) {
        /* We should never have too many actions */
        retVal = E_Return::ERR_HM_FULL;
    }
    else {
        retVal = E_Return::NO_ERROR;
    }

    return retVal;
}

void HealthMonitor::ReportHM(const E_HMEvent kEvent,
                             void*           pParam /* = nullptr */) const
noexcept {
    if (HM_EVENT_MAX > kEvent) {
        /* Execute the registered handler */
        sHMHandlers[kEvent](pParam);
    }
    else {
        LOG_ERROR("HM Event unknown: %d.\n", kEvent);
        HWManager::Reboot();
    }
}

void HealthMonitor::RealTimeTaskRoutine(void* pHealthMonitor) noexcept {
    BaseType_t     result;
    HealthMonitor* pHM;
    Timeout        hmDeadlineTimeout(HW_RT_TASK_DEADLINE_MISS_DELAY);

    pHM = (HealthMonitor*)pHealthMonitor;


    while (true) {
        /* Wait for trigger signal */
        result = xTaskNotifyWait(0xFFFFFFFFUL, 0x0UL, 0x0UL, portMAX_DELAY);
        if (pdPASS != result) {
            HM_REPORT_EVENT(E_HMEvent::HM_EVENT_RT_TASK_WAIT, 1);
        }


        /* Check for deadline miss */
        if (E_SystemState::EXECUTING == pHM->_systemState &&
            hmDeadlineTimeout.Check()) {
            HM_REPORT_EVENT(E_HMEvent::HM_EVENT_RT_TASK_DEADLINE_MISS, nullptr);
        }

        /* Tick the timeout */
        hmDeadlineTimeout.Tick();

        /* Perform HM checks */
        pHM->CheckWatchdogs();
        pHM->CheckReporters();
    }
}

void HealthMonitor::HMActionTaskRoutine(void* pHealthMonitor) noexcept {
    HealthMonitor* pHM;
    HMReporter*    pReporter;
    BaseType_t     result;

    pHM = (HealthMonitor*)pHealthMonitor;

    while (true) {
        /* Get the next job */
        result = xQueueReceive(
            pHM->_actionsQueue,
            (void*)&pReporter,
            portMAX_DELAY
        );

        if (pdPASS != result) {
            HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_ACTION_RECV_FAILED, result);
        }

        /* Execute the action */
        pReporter->ExecuteAction();
    }
}

void HealthMonitor::CheckWatchdogs(void) const noexcept {
    uint64_t                                               currentTime;
    std::unordered_map<uint32_t, Timeout*>::const_iterator it;

    /* Check for watchdogs */
    currentTime = HWManager::GetTime();
    if (pdPASS == xSemaphoreTake(this->_wdLock, WD_LOCK_TIMEOUT_TICKS)) {
        for (it = this->_watchdogs.begin();
             this->_watchdogs.end() != it;
             ++it) {
            /* Check for dealine miss */
            if (it->second->GetNextWatchdogEvent() < currentTime) {
                it->second->ExecuteHandler();
            }
        }

        if (pdPASS != xSemaphoreGive(this->_wdLock)) {
            HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_LOCK, 1);
        }
    }
    else {
        HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_LOCK, 0);
    }
}

void HealthMonitor::CheckReporters(void) const noexcept {
    uint64_t                                                  currentTime;
    std::unordered_map<uint32_t, HMReporter*>::const_iterator it;

    /* Check for HM reporters */
    currentTime = HWManager::GetTime();
    if (pdPASS == xSemaphoreTake(this->_reportersLock, WD_LOCK_TIMEOUT_TICKS)) {
        for (it = this->_reporters.begin();
             this->_reporters.end() != it;
             ++it) {
            it->second->HealthCheck(currentTime);
        }

