Oxmose/ESP32Weather/src/HealthMonitor/HealthMonitor.cpp
        if (pdPASS != xSemaphoreGive(this->_reportersLock)) {
            HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_LOCK, 1);
        }
    }
    else {
        HM_REPORT_EVENT(E_HMEvent::HM_EVENT_HM_LOCK, 0);
    }
}

void HealthMonitor::RealTimeTaskInit(void) noexcept {
    BaseType_t result;

    /* Start the real time task timer */
    this->_RTTaskTimer = timerBegin(
        HW_RT_TASK_TIMER,
        HW_RT_TASK_TIMER_PRESCALER,
        true
    );
    if (nullptr == this->_RTTaskTimer) {
        HM_REPORT_EVENT(E_HMEvent::HM_EVENT_RT_TASK_CREATE, 0);
    }
    timerAttachInterrupt(this->_RTTaskTimer, RealTimeTaskTimerHandler, true);
    timerAlarmWrite(this->_RTTaskTimer, HW_RT_TASK_TIMER_DEC_INT, true);
    timerAlarmEnable(this->_RTTaskTimer);


    /* Create the real-time high-priority task */
    result = xTaskCreatePinnedToCore(
        RealTimeTaskRoutine,
        HW_RT_TASK_NAME,
        HW_RT_TASK_STACK,
        this,
        HW_RT_TASK_PRIO,
        &this->_RTTaskHandle,
        HW_RT_TASK_CORE
    );
    if (pdPASS != result) {
        HM_REPORT_EVENT(E_HMEvent::HM_EVENT_RT_TASK_CREATE, 1);
    }

    sRTTaskHandle = this->_RTTaskHandle;
}

void HealthMonitor::ActionsTaskInit(void) noexcept {
    BaseType_t result;

    /* Create the actions queue */
    this->_actionsQueue = xQueueCreate(
        HM_ACTIONS_TASK_QUEUE_LENGTH,
        sizeof(HMReporter*)
    );
    if (nullptr == this->_actionsQueue) {
        HM_REPORT_EVENT(E_HMEvent::HM_EVENT_ACTION_TASK_CREATE, 0);
    }

    /* Create the real-time high-priority task */
    result = xTaskCreatePinnedToCore(
        HMActionTaskRoutine,
        HM_ACTIONS_TASK_NAME,
        HM_ACTIONS_TASK_STACK,
        this,
        HM_ACTIONS_TASK_PRIO,
        &this->_actionsTaskHandle,
        HM_ACTIONS_TASK_CORE
    );
    if (pdPASS != result) {
        HM_REPORT_EVENT(E_HMEvent::HM_EVENT_ACTION_TASK_CREATE, 1);
    }
}